app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `updated_at`, `first_name`, `Last_name`, `user_id`, `email`, `phone`) VALUES ('2017-12-16 07:09:51', '2017-12-16 07:09:51', 'Shanmukha', 'Reddy', 'shanmukr', 'shanmukr.sw@gmail.com', 8553)
---
  def create
    @user = User.new(user_authorized_params)
    if @user.save!

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `Last_name` = 'Reddy', `updated_at` = '2017-12-16 07:37:03' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_authorized_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find(params[:user])